<h2>Задание 1</h2>
<p>Представьте себе, что вы пишете свою собственную систему рекомендации тура для отпуска. Для упрощения допустим, что рекомендации будут базироваться на типе отдыха (пляжный, активный, семейный).</p>
<h3>Схема рекомендаций:</h3>
<ol>
<li>Если пользователь выбрал пляжный отдых, то программа должна предложить тур в Таиланд.</li>
<li>Если пользователь выбрал активный отдых, то программа должна предложить тур в Австрию на горнолыжный курорт.</li>
<li>Если пользователь выбрал семейный отдых, то программа должна предложить тур в Турцию.</li>
</ol>
<h3>Алгоритм решения:</h3>
<ul>
<li>
<p>Создайте переменную ‘тип отдыха’ с типом int.<br>
Все три варианта значений обозначим числовым значением:<br>
1 — “пляжный отдых”;<br>
2 — “активный отдых”;<br>
3 — “семейный отдых”.<br>
Продемонстрируйте работу программы поочередно для всех трех вариантов.</p>
</li>
<li>
<p>Добавьте условия для выбора рекомендации согласно схеме выше.</p>
</li>
<li>
<p>Результат работы программы — вывод в консоль рекомендации по туру.</p>
</li>
</ul>
<p>Пример условий:</p>
<pre class="hljs"><code>if (typeOfRest == 1) {
    System.out.println("Предлагаем тур в Таиланд для замечательного пляжного отдыха!")
} else if (typeOfRest == 2) {
    ...
} ...
</code></pre>
<h2>Задание 2</h2>
<p>Вам необходимо написать программу вычисления стоимости покупки с учетом скидки.</p>
<h3>Скидочная политика:</h3>
<ul>
<li>При сумме покупки больше 500 руб, скидка — 3%.</li>
<li>При сумме покупки больше 1000 руб., скидка — 5%.</li>
</ul>
<h3>Алгоритм решения:</h3>
<ul>
<li>
<p>Создайте переменную сумма покупки.<br>
Используйте поочередно три значения суммы покупки: 400, 600, 1100.</p>
</li>
<li>
<p>Создайте переменную сумма покупки со скидкой.</p>
</li>
<li>
<p>Добавьте условия сравнения суммы покупки со скидочной политикой.</p>
</li>
<li>
<p>Результатом проверки условия будет одно из действий:</p>
</li>
</ul>
<ol>
<li>Вывод на экран суммы покупки с учетом скидки.</li>
<li>Вывод сообщения о том, что скидка не предоставляется.</li>
</ol>

<p>Решение <a href="https://repl.it/@Netology/JavaStart31">задачи № 3.1</a>.</p>
<pre class="hljs"><code>
class Main {
  public static void main(String[] args) {
    int typeOfRest = 1;
    
    if (typeOfRest == 1) {
      System.out.println("Предлагаем тур в Таиланд для замечательного пляжного отдыха!");
    } else if (typeOfRest == 2) {
      System.out.println("Предлагаем тур в Австрию на горнолыжный курорт!");
    } else if (typeOfRest == 3) {
      System.out.println("Предлагаем тур в Турцию на прекрасный отдых всей семьей!");
    }

    typeOfRest = 2;
    
    if (typeOfRest == 1) {
      System.out.println("Предлагаем тур в Таиланд для замечательного пляжного отдыха!");
    } else if (typeOfRest == 2) {
      System.out.println("Предлагаем тур в Австрию на горнолыжный курорт!");
    } else if (typeOfRest == 3) {
      System.out.println("Предлагаем тур в Турцию на прекрасный отдых всей семьей!");
    }

    typeOfRest = 3;
    
    if (typeOfRest == 1) {
      System.out.println("Предлагаем тур в Таиланд для замечательного пляжного отдыха!");
    } else if (typeOfRest == 2) {
      System.out.println("Предлагаем тур в Австрию на горнолыжный курорт!");
    } else if (typeOfRest == 3) {
      System.out.println("Предлагаем тур в Турцию на прекрасный отдых всей семьей!");
    }
  }
}
</code></pre>

<p>Решение <a href="https://repl.it/@Netology/JavaStart32">задачи № 3.2</a>.</p>
<pre class="hljs"><code>
class Main {
  public static void main(String[] args) {
    int totalAmount = 400;
    float totalAmountWithDiscount;

    if (totalAmount > 1000) {
      totalAmountWithDiscount = totalAmount - (totalAmount * 5/ 100);
      System.out.println("Скидка - 5%. Сумма со скидкой - " + totalAmountWithDiscount); 
    } else if (totalAmount > 500){
      totalAmountWithDiscount = totalAmount - (totalAmount * 3/ 100);
      System.out.println("Скидка - 3%. Сумма со скидкой - " + totalAmountWithDiscount);
    } else {
      totalAmountWithDiscount = totalAmount;
      System.out.println("Скидка не предоставляется. Сумма - " + totalAmountWithDiscount);
    }

  totalAmount = 600;

    if (totalAmount > 1000) {
      totalAmountWithDiscount = totalAmount - (totalAmount * 5/ 100);
      System.out.println("Скидка - 5%. Сумма со скидкой - " + totalAmountWithDiscount); 
    } else if (totalAmount > 500){
      totalAmountWithDiscount = totalAmount - (totalAmount * 3/ 100);
      System.out.println("Скидка - 3%. Сумма со скидкой - " + totalAmountWithDiscount);
    } else {
      totalAmountWithDiscount = totalAmount;
      System.out.println("Скидка не предоставляется. Сумма - " + totalAmountWithDiscount);
    }

    totalAmount = 1100;

    if (totalAmount > 1000) {
      totalAmountWithDiscount = totalAmount - (totalAmount * 5/ 100);
      System.out.println("Скидка - 5%. Сумма со скидкой - " + totalAmountWithDiscount); 
    } else if (totalAmount > 500){
      totalAmountWithDiscount = totalAmount - (totalAmount * 3/ 100);
      System.out.println("Скидка - 3%. Сумма со скидкой - " + totalAmountWithDiscount);
    } else {
      totalAmountWithDiscount = totalAmount;
      System.out.println("Скидка не предоставляется. Сумма - " + totalAmountWithDiscount);
    }

  }
}
</code></pre>


