<h2>Задание 1</h2>
<p>Представьте себе, что вы пишете свою собственную систему рекомендации тура для отпуска. Для упрощения допустим, что рекомендации будут базироваться на типе отдыха (пляжный, активный, семейный).</p>
<h3>Схема рекомендаций:</h3>
<ol>
<li>Если пользователь выбрал пляжный отдых, то программа должна предложить тур в Таиланд.</li>
<li>Если пользователь выбрал активный отдых, то программа должна предложить тур в Австрию на горнолыжный курорт.</li>
<li>Если пользователь выбрал семейный отдых, то программа должна предложить тур в Турцию.</li>
</ol>
<h3>Алгоритм решения:</h3>
<ul>
<li>
<p>Создайте переменную ‘тип отдыха’ с типом int.<br>
Все три варианта значений обозначим числовым значением:<br>
1 — “пляжный отдых”;<br>
2 — “активный отдых”;<br>
3 — “семейный отдых”.<br>
Продемонстрируйте работу программы поочередно для всех трех вариантов.</p>
</li>
<li>
<p>Добавьте условия для выбора рекомендации согласно схеме выше.</p>
</li>
<li>
<p>Результат работы программы — вывод в консоль рекомендации по туру.</p>
</li>
</ul>
<p>Пример условий:</p>
<pre class="hljs"><code>if (typeOfRest == 1) {
    System.out.println("Предлагаем тур в Таиланд для замечательного пляжного отдыха!")
} else if (typeOfRest == 2) {
    ...
} ...
</code></pre>
<h2>Задание 2</h2>
<p>Вам необходимо написать программу вычисления стоимости покупки с учетом скидки.</p>
<h3>Скидочная политика:</h3>
<ul>
<li>При сумме покупки больше 500 руб, скидка — 3%.</li>
<li>При сумме покупки больше 1000 руб., скидка — 5%.</li>
</ul>
<h3>Алгоритм решения:</h3>
<ul>
<li>
<p>Создайте переменную сумма покупки.<br>
Используйте поочередно три значения суммы покупки: 400, 600, 1100.</p>
</li>
<li>
<p>Создайте переменную сумма покупки со скидкой.</p>
</li>
<li>
<p>Добавьте условия сравнения суммы покупки со скидочной политикой.</p>
</li>
<li>
<p>Результатом проверки условия будет одно из действий:</p>
</li>
</ul>
<ol>
<li>Вывод на экран суммы покупки с учетом скидки.</li>
<li>Вывод сообщения о том, что скидка не предоставляется.</li>
</ol>
